#include "hhh.h"
int count=0;
void creat(data *h);
int del(data *h,data *t,int j);
void inc(data *h, data *t);
int mod(data *h,data *t);
void output(data* h);
void fio(data *h);
void hei(data *h);
void watt(data *h,data *t);
int ser(data * h, data * t);
int menu(int x)
{
    printf("┌────────────────────────────────────────────────────────────────┐\n");
    printf("│                  月巴龙电子图书馆借阅管理系统                  │\n");
    printf("├────────────────────────────────────────────────────────────────┤\n");
    if(x==0)
        printf("│                  请输入一位数字选择接下来的操作                │\n");
    else
        printf("│                        输入错误，请重试                        │\n");
    printf("├──────────────────────────────┬─────────────────────────────────┤\n");
    printf("│    1：输入序号,姓名,书籍,日期│     6：查阅一组特定数据         │\n");
    printf("├──────────────────────────────┼─────────────────────────────────┤\n");
    printf("│    2：输出当前所有数据       │     7：导出至EXCEL文件          │\n");
    printf("├──────────────────────────────┼─────────────────────────────────┤\n");
    printf("│    3：增加几组特定数据       │     8：查看书籍借阅人气榜       │\n");
    printf("├──────────────────────────────┼─────────────────────────────────┤\n");
    printf("│    4：删除一组特定数据       │     9：根据姓名查看借阅记录     │\n");
    printf("├──────────────────────────────┼─────────────────────────────────┤\n");
    printf("│    5：修改一组特定数据       │     0：退出书籍管理程序         │\n");
    printf("└──────────────────────────────┴─────────────────────────────────┘\n");
    return 0;
}
int main()
{
    data *head,*t;
    int n=0,m,j,cc;
    head=(data*)malloc(sizeof(data));
    head->next=NULL;
    char code[10];
    menu(0);
    while(scanf("%s",code)!=EOF)
    {
        switch(code[0])
        {
        case '1':
            cc=0;
            printf("┌────────────────────────────────────────────────────────────────┐\n");
            printf("│                    请输入所有数据,以0结尾                      │\n");
            printf("└────────────────────────────────────────────────────────────────┘\n");
            t=(data*)malloc(sizeof(data));
            t->next=NULL;
            scanf("%d",&t->num);
            while(t->num!=0&&t->num!=EOF)
            {
                scanf("%s %s %d",&t->name,&t->book,&t->date);
                inc(head,t);
                cc++;
                count++;
                t=(data*)malloc(sizeof(data));
                t->next=NULL;
                scanf("%d",&t->num);
            }
            printf("┌────────────────────────────────────────────────────────────────┐\n");
            printf("│                        共输入%3d组数据                         │\n",cc);
            printf("└────────────────────────────────────────────────────────────────┘\n");
            printf("\n");
            menu(0);
            break;
        case '2':
            if(count==0)
            {
                printf("┌────────────────────────────────────────────────────────────────┐\n");
                printf("│                        当前未储存任何数据                      │\n");
                menu(1);
                break;
            }
            printf("┌────────────────────────────────────────────────────────────────┐\n");
            printf("│                      当前共有%3d组数据                         │\n",count);
            printf("└────────────────────────────────────────────────────────────────┘\n");
            output(head);
            menu(0);
            break;
        case '3':
            m=0;
            printf("┌────────────────────────────────────────────────────────────────┐\n");
            printf("│                     请输入插入数据的组数                       │\n");
            printf("└────────────────────────────────────────────────────────────────┘\n");
            scanf("%d",&j);
            count+=j;
            for(; m<j; m++)
            {
                printf("┌────────────────────────────────────────────────────────────────┐\n");
                printf("│                 请输入数据(第%3d组，共%3d组)                   │\n",m+1,j);
                printf("└────────────────────────────────────────────────────────────────┘\n");
                t=(data*)malloc(sizeof(data));
                t->next=NULL;
                scanf("%d %s %s %d",&t->num,&t->name,&t->book,&t->date);
                inc(head,t);
            }
            menu(0);
            break;
        case '4':
            printf("┌────────────────────────────────────────────────────────────────┐\n");
            printf("│                          1：删除特定序列号                     │\n");
            printf("│                          2：删除特定姓名                       │\n");
            printf("│                          3：删除特定书籍                       │\n");
            printf("├────────────────────────────────────────────────────────────────┤\n");
            printf("│\n");
            scanf("%d",&j);
            switch(j)
            {
            case 1:
                printf("├────────────────────────────────────────────────────────────────┤\n");
                printf("│                         输入删除数据的序列号                   │\n");
                t=(data*)malloc(sizeof(data));
                t->next=NULL;
                scanf("%d",&t->num);
                n=del(head,t,j);
                if(n==0)
                {
                    printf("│                          未找到相应数据                        │\n");
                    printf("└────────────────────────────────────────────────────────────────┘\n");
                }
                else
                {
                    printf("│                               已删除                           │\n");
                    printf("└────────────────────────────────────────────────────────────────┘\n");
                }
                break;
            case 2:
                printf("├────────────────────────────────────────────────────────────────┤\n");
                printf("│                         输入删除数据的姓名                     │\n");
                t=(data*)malloc(sizeof(data));
                t->next=NULL;
                scanf("%s",t->name);
                n=del(head,t,j);
                if(n==0)
                {
                    printf("│                          未找到相应数据                        │\n");
                    printf("└────────────────────────────────────────────────────────────────┘\n");
                }
                else
                {
                    printf("│                         已删除%3d组数据                        │\n",n);
                    printf("└────────────────────────────────────────────────────────────────┘\n");
                }
                break;
            case 3:
                printf("├────────────────────────────────────────────────────────────────┤\n");
                printf("│                         输入删除书籍的名称                     │\n");
                t=(data*)malloc(sizeof(data));
                t->next=NULL;
                scanf("%s",t->book);
                n=del(head,t,j);
                if(n==0)
                {
                    printf("│                          未找到相应数据                        │\n");
                    printf("└────────────────────────────────────────────────────────────────┘\n");
                }
                else
                {
                    printf("│                         已删除%3d组数据                        │\n",n);
                    printf("└────────────────────────────────────────────────────────────────┘\n");
                }
                break;
            }

            menu(0);
            break;
        case '5':
            if(count==0)
            {
                printf("┌────────────────────────────────────────────────────────────────┐\n");
                printf("│                        当前未储存任何数据                      │\n");
                menu(1);
                break;
            }
            printf("┌────────────────────────────────────────────────────────────────┐\n");
            printf("│                         输入修改数据的编号                     │\n");
            t=(data*)malloc(sizeof(data));
            t->next=NULL;
            scanf("%d",&t->num);
            n=mod(head,t);
            if(n==1)
                output(head);
            menu(0);
            break;
        case '6':
            if(count==0)
            {
                printf("┌────────────────────────────────────────────────────────────────┐\n");
                printf("│                        当前未储存任何数据                      │\n");
                menu(1);
                break;
            }
            printf("┌────────────────────────────────────────────────────────────────┐\n");
            printf("│                       请输入检索数据的序列号                   │\n");
            printf("└────────────────────────────────────────────────────────────────┘\n");
            t=(data*)malloc(sizeof(data));
            t->next=NULL;
            scanf("%d",&t->num);
            n=ser(head,t);
            if(n==0)
            {
                printf("│                          未找到相应数据                        │\n");
                printf("└────────────────────────────────────────────────────────────────┘\n");
            }
            menu(0);
            break;
        case '7':
            if(count==0)
            {
                printf("┌────────────────────────────────────────────────────────────────┐\n");
                printf("│                        当前未储存任何数据                      │\n");
                menu(1);
                break;
            }
            fio(head);
            menu(0);
            break;
        case '8':
            if(count==0)
            {
                printf("┌────────────────────────────────────────────────────────────────┐\n");
                printf("│                        当前未储存任何数据                      │\n");
                menu(1);
                break;
            }
            hei(head);
            menu(0);
            break;
        case '9':
            if(count==0)
            {
                printf("┌────────────────────────────────────────────────────────────────┐\n");
                printf("│                        当前未储存任何数据                      │\n");
                menu(1);
                break;
            }
            printf("┌────────────────────────────────────────────────────────────────┐\n");
            printf("│                      请输入检索对象的姓名                      │\n");
            printf("└────────────────────────────────────────────────────────────────┘\n");
            t=(data*)malloc(sizeof(data));
            t->next=NULL;
            scanf("%s",&t->name);
            watt(head,t);
            menu(0);
            break;
        case '0':
            printf("┌────────────────────────────────────────────────────────────────┐\n");
            printf("│                          谢谢使用！                            │\n");
            printf("└────────────────────────────────────────────────────────────────┘\n");
            return 0;
        default :
            menu(1);
        }
    }
    return 0;
}
