#include "hhh.h"
int mod(data *p,data *w)
{
    data *f;
    int i=0;
    f=p->next;
    while(f!=NULL&&f->num!=w->num)
    {
        f=f->next;
        i++;
    }
    if(f==NULL)
    {
        printf("┌────────────────────────────────────────────────────────────────┐\n");
        printf("│                          未找到相应数据                        │\n");
        printf("└────────────────────────────────────────────────────────────────┘\n");
        return 0;
    }
    else
    {
        printf("┌────────────────────────────────────────────────────────────────┐\n");
        printf("│            请输入数据该组数据的姓名与书籍和借阅日期            │\n");
        printf("└────────────────────────────────────────────────────────────────┘\n");
        scanf("%s %s %d",w->name,w->book,&w->date);
        f->num=w->num;
        strcpy(f->name,w->name);
        strcpy(f->book,w->book);
        f->date=w->date;
        printf("│                              已完成改动                        │\n");
        printf("└────────────────────────────────────────────────────────────────┘\n");
        return 1;
    }


}
